import LinkBtn from '@/components/LinkBtn/LinkBtn';

import styles from "@/app/servicesSheets/page.module.css";

export const metadata = {
  title: 'Аркуші | НВФ Покров',
  description: 'Реалізація аркушів з нержавіючої сталі',
};

export default function ServicesDome() {
  return (
    <section className='sectionsWrapper'>
      <h1>Реалізація аркушів з нержавіючої сталі</h1>
      <p>
        Компанія «Покров» пропонує високоякісні листи з нержавіючої сталі для
        покриття будівель та церковних куполів. Наша продукція доступна в
        широкому асортименті кольорів, включаючи золотий, мідний, зелений та
        небесно-синій.
      </p>
      <p>
        Ми досягаємо такого різноманіття кольорів завдяки використанню не тільки
        нітрид-титанових напилень, але й інших сплавів з титану. Це дозволяє
        дизайнерам та архітекторам мати безліч можливостей для реалізації своїх
        нестандартних ідей.
      </p>
      <p>
        Наші листи виготовлені з високоякісної технічної магнітної сталі,
        відповідно до американського стандарту AISI 430 (розмір 1000х2000х0,4
        мм). За замовленням ми можемо також виготовити листи з харчової,
        немагнітної сталі AISI304, вкритої титановими з’єднаннями.
      </p>
      <p>
        Ми гарантуємо якість нашої продукції, яка підтверджена сертифікатами та
        спеціальними аналізами, проведеними на базі лабораторії НВФ «Покров».
      </p>
      <div className={styles.nav}>
        <LinkBtn url="/services" text="Послуги" />
        <LinkBtn url="/portfolio/sheets" text="Галерея робіт" />
      </div>
    </section>
  );
}
