import styles from '@/components/QualityGuarantee/QualityGuarantee.module.css';
import SertificatesList from '@/components/SertificatesList/SertificatesList';

const sertificates = [
  { id: '1', text: 'TУ У 25.6-37651685-001:2012 Покриття металеві іонно-плазмові. Технічні умови' },
  { id: '2', text: 'Сертифікат відповідності (якості) UA1.012.0006075' },
  { id: '3', text: 'Сертифікат відповідності (якості) UA1.012.0017193' },
  { id: '4', text: 'ГОСТ 9.308, ГОСТ 9.908, OCT 92-1346' },
  { id: '5', text: 'ГОСТ 1982, ГОСТ 19282' },
];

const QualityGuarantee = () => {
  return (
    <section className={styles.wrapper}>
        <h2>Гарантія якості</h2>
        <p>Ми забезпечуємо надійність наших виробів протягом 50 років завдяки високоякісному покриттю їх нітридом титану, що захищає від атмосферних факторів, включаючи агресивні та промислові умови.</p>
        <p>Вся продукція, що виготовляється підприємством, відповідає нормативним документам за ТУ У 25.6-37651685-001:2012 “Покриття металеві іонно-плазмові” та підтверджена сертифікатом якості.</p>
        <p>Програма гарантії якості виробництва ТОВ “НВФ “Покров” була розроблена для задоволення вимог нашого ринку, включаючи наступні галузеві норми:</p>
        <SertificatesList sertificates={sertificates}/>
    </section>
  );
};

export default QualityGuarantee;