import Link from "next/link";
import Image from "next/image";

const page = () => {
  return (
    <>
      <div className="grid grid-cols-1 xl:grid-cols-2 gap-1 md:gap-6">
        <div
          className="w-full h-[200px] md:h-[250px] xl:h-auto bg-cover rounded-md"
          style={{
            backgroundImage: "url('/cross.jpg')",
            backgroundSize: "cover",
            backgroundRepeat: "no-repeat",
            backgroundPosition: "0% 25%",
          }}
        ></div>
        <div>
          <h1 className="divider divider-accent font-bold text-xs md:text-sm xl:text-lg">
            Проектування та виготовлення хрестів
          </h1>
          <ul className="flex flex-col gap-1 md:gap-2 text-xs md:text-sm xl:text-base">
            <li>
              <p>
                TOB &quot;НВФ &quot;Покров&quot; спеціалізується на проектуванні
                та виготовленні накупольних хрестів різної складності,
                конфігурацій та габаритів. Ми використовуємо унікальну
                інноваційну технологію вакуумно-плазмового напилення, що
                дозволяє нам створювати навіть найбільш нестандартні проекти на
                основі високоякісної нержавіючої сталі, покритої захисним шаром
                нітрид титану.
              </p>
            </li>
            <li>
              <p>
                Наша компанія пропонує виготовлення накупольних хрестів у трьох
                основних категоріях:
              </p>
            </li>
            <li>
              <p>
                1. Вироби, що повністю, включаючи основну частину та всі
                декоративні елементи, складаються зі сталі. Це найбільш
                розповсюджений вид хрестів, який виготовляється за давньою
                методикою, що вже багато років використовується світовими
                майстрами.
              </p>
            </li>
            <li>
              <p>
                2. Накупольні хрести з елементами вітражу. Декоративні акценти з
                фацетованого скла надають виробам неповторного вигляду: хрест
                грає різними кольорами в сонячних променях.
              </p>
            </li>
            <li>
              <p>
                3. Хрести з електричним підсвічуванням елементів. B нічний час
                вони створюють унікальний ефект сяяння куполу.
              </p>
            </li>
            <li>
              <p>
                Дві останні категорії виробів - особиста розробка наших
                спеціалістів. Ми готові реалізувати їх під ваше замовлення. Для
                вас доступні як вже готові проекти, так i можливість роботи за
                наданим вами ескізом. Обирайте накупольні хрести від
                &quot;Покрову&quot; та зробіть свою церкву неповторною.
              </p>
            </li>
          </ul>
          <ul className="flex justify-around text-xs md:text-sm xl:text-base p-5">
            <li>
              <Link href="/services" className="btn btn-ghost">
                Повернутися
              </Link>
            </li>
            <li>
              <Link href="/portfolio/cross" className="btn btn-ghost">
                Галерея робіт
              </Link>
            </li>
          </ul>
        </div>
      </div>
    </>
  );
};

export default page;
