import LinkBtn from '@/components/LinkBtn/LinkBtn';

import styles from "@/app/servicesDome/page.module.css";

export const metadata = {
  title: 'Куполи | НВФ Покров',
  description: 'Проектування та виготовлення куполів для церков та соборів',
};

export default function ServicesDome() {
  return (
    <section>
      <h1>Проектування та виготовлення куполів для церков та соборів</h1>
      <p>
        У нашому проектному відділі працюють висококваліфіковані фахівці, які
        проходять спеціальну підготовку та атестацію. Ми застосовуємо сучасний
        підхід до проектування, використовуючи ліцензійну програму для створення
        точної 3D-моделі куполу. Наші інженери уважно вивчають всі деталі, що
        включають характер та кількість необхідних матеріалів, технології
        виробництва та взаємодію фахівців на різних етапах проектування.
      </p>
      <p>
        Ми звертаємо увагу на кліматичні особливості регіону, сумісність з
        закладними деталями, особливості транспортування та можливі способи
        монтажу. Комплексний підхід та висока професійність кожного
        співробітника дозволяє нам створювати максимально точну проектну
        документацію для високотехнологічних виробів. Ми дотримуємось
        поставлених строків та враховуємо всі побажання наших клієнтів.
      </p>
      <p>
        Після розробки проекту майстри беруться за виготовлення куполу. Вони
        виконують всі необхідні роботи, такі як виготовлення каркасу, обшивку
        конструкції деревом та покриття листом нержавіючої сталі з нанесенням
        нітриду титану. Ми дотримуємось всіх норм безпеки та чітко дотримуємось
        проектної документації, щоб забезпечити безпечну та якісну роботу. Всі
        роботи виконуються строго відповідно до строку, оговореного із
        замовником.
      </p>
      <div className={styles.nav}>
        <LinkBtn url="/services" text="Послуги" />
        <LinkBtn url="/portfolio/domes" text="Галерея робіт" />
      </div>
    </section>
  );
}
