import Image from 'next/image';

import tech from '../../../public/technology.jpg';
import cheked from '../../../public/checked.svg';

import styles from '@/app/technology/page.module.css';

export const metadata = {
  title: 'Технології | НВФ Покров',
};

const Technology = () => {
  return (
    <section className="sectionsWrapper">
      <h1>Технології</h1>
      <div className={styles.wrapper}>
        <div className="tech__description">
          <p className={styles.text}>
            Технологія вакуумного напилення, також відома як фізичне відкладення
            парової фази (PVD), є процесом, при якому тонкі шари матеріалу
            відкладаються на поверхні іншого матеріалу за допомогою вакуумної
            камери.
          </p>
          <p className={styles.text}>
            У процесі вакуумного напилення, матеріал, який потрібно відкласти на
            поверхню, нагрівається до високої температури, після чого він
            випаровується і знаходиться в газоподібній фазі. Далі він
            конденсується на поверхні деталі, що має бути покритою, утворюючи
            тонкий шар.
          </p>
          <p className={styles.text}>
            Процес вакуумного напилення може бути використаний для відкладання
            різних матеріалів, включаючи метали, кераміку, пластмасу, скло та
            інші матеріали. Ця технологія застосовується в багатьох галузях,
            таких як виробництво напівпровідників, аерокосмічна та автомобільна
            промисловість, медицина, електроніка та інші.
          </p>
          <p className={styles.text}>
            Основними перевагами вакуумного напилення є висока якість тонкого
            шару, дуже малі розміри і товщина шару, висока адгезія до поверхні,
            висока чистота та точність розміщення матеріалу на поверхні. Однак,
            ця технологія має свої обмеження, зокрема відносно до розміру
            деталі, яку потрібно покрити, та витрат на обладнання та матеріали.
          </p>
        </div>

        <Image src={tech} priority alt="Photo of technological equipment" />
      </div>      
      <h2>Технологія вакуумного напилення має декілька переваг, серед яких:</h2>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Висока якість покриття: вакуумне напилення забезпечує однорідне,
          безпомилкове покриття, яке має високу адгезію до поверхні.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Висока точність: технологія вакуумного напилення дозволяє контролювати
          товщину покриття з високою точністю, що дозволяє досягти потрібної
          якості продукту.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Економія матеріалів: вакуумне напилення вимагає менше матеріалів для
          покриття поверхні порівняно з іншими технологіями, що дозволяє
          зменшити витрати на матеріали.
      </p>
      <p className={styles.text}>
          <Image src={cheked} alt="Icon" />
          Не впливає на властивості матеріалу: технологія вакуумного напилення
          не змінює фізичні та хімічні властивості матеріалу, що дозволяє
          зберігати його властивості.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Висока стійкість: покриття, отримане за допомогою вакуумного
          напилення, має високу стійкість до зносу, корозії та інших впливів
          навколишнього середовища.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Безпека: вакуумне напилення є безпечним для довкілля та людей,
          оскільки не використовує хімічні речовини, що можуть бути шкідливими.
      </p>
      <p className={styles.text}>
          Такі переваги дозволяють технології вакуумного напилення бути корисною
          в багатьох галузях, включаючи медицину, електроніку, виробництво
          напівпровідників, промисловість та інші.
      </p>      
      <h2>
          Вакуумна технологія напилення нітриду титану складається з декількох
          етапів:
      </h2>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Підготовка матеріалу або виробу, який буде оброблятись, за допомогою
          ретельної механічної та електрохімічної обробки.
      </p>
      <p className={styles.text}>
          <Image src={cheked} alt="Icon" />
          Знегазування вакуумом безпосередньо в установці.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Іонне очищення поверхні для підвищення якості покриття.
      </p>
      <p className={styles.text}>
          <Image src={cheked} alt="Icon" />
          Розпилення покриття нітриду титану на поверхню виробу.
      </p>
      <p className={styles.text}>
          <Image src={cheked} alt="Icon" />
          Формування нітрид-титанової плівки на поверхні виробу.
      </p>
      <p className={styles.text}>
      <Image src={cheked} alt="Icon" />
          Термічна обробка плівки при температурі, що дещо перевищує температуру
          розпилення, для закріплення ефекту покриття.
      </p>      
    </section>
  );
};

export default Technology;
