import Link from "next/link";

const page = () => {
  return (
    <>
      <div className="grid grid-cols-1 xl:grid-cols-2 gap-1 md:gap-2">
        <div
          className="w-full h-[100px] md:h-[250px] xl:h-auto bg-cover rounded-md"
          style={{
            backgroundImage: "url('/domes.jpg')",
          }}
        ></div>
        <div>
          <h1 className="divider divider-accent font-bold xl:text-lg">
            Проектування та виготовлення куполів
          </h1>
          <ul className="flex flex-col gap-1 md:gap-2 text-xs md:text-sm xl:text-base">
            <li>
              <p>
                У нашому проектному відділі працюють висококваліфіковані
                фахівці, які проходять спеціальну підготовку та атестацію. Ми
                застосовуємо сучасний підхід до проектування, використовуючи
                ліцензійну програму для створення точної 3D-моделі куполу. Наші
                інженери уважно вивчають всі деталі, що включають характер та
                кількість необхідних матеріалів, технології виробництва та
                взаємодію фахівців на різних етапах проектування.
              </p>
            </li>
            <li>
              <p>
                Ми звертаємо увагу на кліматичні особливості регіону, сумісність
                з закладними деталями, особливості транспортування та можливі
                способи монтажу. Комплексний підхід та висока професійність
                кожного співробітника дозволяє нам створювати максимально точну
                проектну документацію для високотехнологічних виробів. Ми
                дотримуємось поставлених строків та враховуємо всі побажання
                наших клієнтів.
              </p>
            </li>
            <li>
              <p>
                Після розробки проекту майстри беруться за виготовлення куполу.
                Вони виконують всі необхідні роботи, такі як виготовлення
                каркасу, обшивку конструкції деревом та покриття листом
                нержавіючої сталі з нанесенням нітриду титану. Ми дотримуємось
                всіх норм безпеки та чітко дотримуємось проектної документації,
                щоб забезпечити безпечну та якісну роботу. Роботи виконуються
                строго відповідно до строку, оговореного із замовником.
              </p>
            </li>
          </ul>
          <ul className="flex justify-around text-xs md:text-sm xl:text-base p-5">
            <li>
              <Link href="/services" className="btn btn-ghost">
                Повернутися
              </Link>
            </li>
            <li>
              <Link href="/portfolio/domes" className="btn btn-ghost">
                Галерея робіт
              </Link>
            </li>
          </ul>
        </div>
      </div>
    </>
  );
};

export default page;
