import LinkBtn from '@/components/LinkBtn/LinkBtn';

import styles from "@/app/servicesCross/page.module.css";

export const metadata = {
  title: 'Хрести | НВФ Покров',
  description: 'Проектування та виготовлення накупольних хрестів',
};

export default function ServicesDome() {
  return (
    <section className='sectionsWrapper'>
      <div className={styles.imgContainer}></div>
      <div className={styles.descriptions}>
      <h1>Проектування та виготовлення накупольних хрестів</h1>
      <p>
        Наша компанія спеціалізується на проектуванні та виготовленні
        накупольних хрестів різної складності, конфігурацій та габаритів. Ми
        використовуємо унікальну інноваційну технологію вакуумно-плазмового
        напилення, що дозволяє нам створювати навіть найбільш нестандартні
        проекти на основі високоякісної нержавіючої сталі, покритої захисним
        шаром нітрид титану.
      </p>
      <p>
        Фірма «Покров» пропонує виготовлення накупольних хрестів у трьох
        основних категоріях:
      </p>
      <p>
        1. Вироби, що повністю, включаючи основну частину та всі декоративні
        елементи, складаються зі сталі. Це найбільш розповсюджений вид хрестів,
        який виготовляється за давньою методикою, що вже багато років
        використовується світовими майстрами.
      </p>
      <p>
        2. Накупольні хрести з елементами вітражу. Декоративні акценти з
        фацетованого скла надають виробам неповторного вигляду: хрест грає
        різними кольорами в сонячних променях.
      </p>
      <p>
        3. Хрести з електричним підсвічуванням елементів. В нічний час вони
        створюють унікальний ефект сяяння куполу.
      </p>
      <p>
        Дві останні категорії виробів – особиста розробка наших спеціалістів. Ми
        готові реалізувати їх під ваше замовлення. Для вас доступні як вже
        готові проекти, так і можливість роботи за наданим вами ескізом.
        Обирайте накупольні хрести від «Покрову» та зробіть свою церкву
        неповторною.
      </p>
      </div>
      <div className={styles.nav}>
        <LinkBtn url="/services" text="Послуги" />
        <LinkBtn url="/portfolio/cross" text="Галерея робіт" />
      </div>
    </section>
  );
}
